scripts/benchmark-exp-logs/hotel-reservation/hotel-reservation-istio-benchmark-2-8.log
Running 1m test @ http://frontend.hotel-res.svc.cluster.local:5000
  2 threads and 8 connections
  Thread calibration: mean lat.: 4664.806ms, rate sampling interval: 16924ms
  Thread calibration: mean lat.: 4258.037ms, rate sampling interval: 15237ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.16s     8.10s   30.97s    63.79%
    Req/Sec   606.40      4.45   615.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.40s 
 75.000%   21.41s 
 90.000%   25.67s 
 99.000%   30.97s 
 99.900%   32.93s 
 99.990%   33.26s 
 99.999%   33.29s 
100.000%   33.29s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.196     0.000000            1         1.00
    3260.415     0.100000         6079         1.11
    7663.615     0.200000        12162         1.25
   10559.487     0.300000        18261         1.43
   12992.511     0.400000        24332         1.67
   15400.959     0.500000        30408         2.00
   16596.991     0.550000        33439         2.22
   17793.023     0.600000        36474         2.50
   18989.055     0.650000        39523         2.86
   20201.471     0.700000        42554         3.33
   21413.887     0.750000        45613         4.00
   22036.479     0.775000        47143         4.44
   22659.071     0.800000        48633         5.00
   23298.047     0.825000        50162         5.71
   23937.023     0.850000        51700         6.67
   24641.535     0.875000        53214         8.00
   25116.671     0.887500        53976         8.89
   25673.727     0.900000        54714        10.00
   26361.855     0.912500        55472        11.43
   27082.751     0.925000        56239        13.33
   27787.263     0.937500        56998        16.00
   28147.711     0.943750        57384        17.78
   28508.159     0.950000        57769        20.00
   28852.223     0.956250        58145        22.86
   29179.903     0.962500        58513        26.67
   29540.351     0.968750        58893        32.00
   29720.575     0.971875        59098        35.56
   29884.415     0.975000        59274        40.00
   30064.639     0.978125        59470        45.71
   30228.479     0.981250        59652        53.33
   30425.087     0.984375        59844        64.00
   30556.159     0.985938        59941        71.11
   30687.231     0.987500        60040        80.00
   30867.455     0.989062        60132        91.43
   31064.063     0.990625        60225       106.67
   31260.671     0.992188        60320       128.00
   31342.591     0.992969        60363       142.22
   31457.279     0.993750        60411       160.00
   31588.351     0.994531        60461       182.86
   31686.655     0.995313        60509       213.33
   31801.343     0.996094        60553       256.00
   31948.799     0.996484        60577       284.44
   32096.255     0.996875        60600       320.00
   32260.095     0.997266        60624       365.71
   32407.551     0.997656        60650       426.67
   32538.623     0.998047        60671       512.00
   32604.159     0.998242        60683       568.89
   32702.463     0.998437        60697       640.00
   32784.383     0.998633        60708       731.43
   32866.303     0.998828        60719       853.33
   32948.223     0.999023        60730      1024.00
   32980.991     0.999121        60736      1137.78
   33030.143     0.999219        60744      1280.00
   33062.911     0.999316        60749      1462.86
   33095.679     0.999414        60755      1706.67
   33128.447     0.999512        60761      2048.00
   33144.831     0.999561        60765      2275.56
   33161.215     0.999609        60767      2560.00
   33177.599     0.999658        60770      2925.71
   33193.983     0.999707        60772      3413.33
   33226.751     0.999756        60777      4096.00
   33226.751     0.999780        60777      4551.11
   33243.135     0.999805        60780      5120.00
   33243.135     0.999829        60780      5851.43
   33259.519     0.999854        60784      6826.67
   33259.519     0.999878        60784      8192.00
   33259.519     0.999890        60784      9102.22
   33259.519     0.999902        60784     10240.00
   33259.519     0.999915        60784     11702.86
   33275.903     0.999927        60787     13653.33
   33275.903     0.999939        60787     16384.00
   33275.903     0.999945        60787     18204.44
   33275.903     0.999951        60787     20480.00
   33275.903     0.999957        60787     23405.71
   33275.903     0.999963        60787     27306.67
   33292.287     0.999969        60789     32768.00
   33292.287     1.000000        60789          inf
#[Mean    =    15157.682, StdDeviation   =     8099.221]
#[Max     =    33275.904, Total count    =        60789]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  72348 requests in 1.00m, 38.88MB read
  Socket errors: connect 0, read 0, write 0, timeout 185
Requests/sec:   1205.80
Transfer/sec:    663.50KB