scripts/benchmark-exp-logs/hotel-reservation/hotel-reservation-tcpdump-benchmark-2-160.log
1Running 1m test @ http://frontend.hotel-res.svc.cluster.local:5000
  2 threads and 160 connections
  Thread calibration: mean lat.: 1502.074ms, rate sampling interval: 5304ms
  Thread calibration: mean lat.: 1506.248ms, rate sampling interval: 5398ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.01s     4.71s   19.32s    58.34%
    Req/Sec     6.77k   136.06     6.99k    55.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.95s 
 75.000%   15.02s 
 90.000%   17.55s 
 99.000%   19.32s 
 99.900%   20.02s 
 99.990%   20.30s 
 99.999%   20.66s 
100.000%   20.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2117.631     0.000000            1         1.00
    4521.983     0.100000        67744         1.11
    6180.863     0.200000       135321         1.25
    7704.575     0.300000       202881         1.43
    9363.455     0.400000       270590         1.67
   10952.703     0.500000       338429         2.00
   11771.903     0.550000       372217         2.22
   12664.831     0.600000       405960         2.50
   13467.647     0.650000       439660         2.86
   14221.311     0.700000       473352         3.33
   15015.935     0.750000       507336         4.00
   15425.535     0.775000       524072         4.44
   15884.287     0.800000       541260         5.00
   16302.079     0.825000       557999         5.71
   16728.063     0.850000       574858         6.67
   17154.047     0.875000       592000         8.00
   17350.655     0.887500       600417         8.89
   17547.263     0.900000       608974        10.00
   17743.871     0.912500       617620        11.43
   17940.479     0.925000       625676        13.33
   18137.087     0.937500       634075        16.00
   18251.775     0.943750       638575        17.78
   18350.079     0.950000       642663        20.00
   18464.767     0.956250       646781        22.86
   18595.839     0.962500       651310        26.67
   18726.911     0.968750       655553        32.00
   18792.447     0.971875       657493        35.56
   18857.983     0.975000       659337        40.00
   18939.903     0.978125       661571        45.71
   19021.823     0.981250       663813        53.33
   19103.743     0.984375       665664        64.00
   19152.895     0.985938       666734        71.11
   19218.431     0.987500       667957        80.00
   19283.967     0.989062       669051        91.43
   19349.503     0.990625       670099       106.67
   19415.039     0.992188       671011       128.00
   19464.191     0.992969       671651       142.22
   19496.959     0.993750       672070       160.00
   19546.111     0.994531       672564       182.86
   19611.647     0.995313       673127       213.33
   19677.183     0.996094       673604       256.00
   19726.335     0.996484       673898       284.44
   19759.103     0.996875       674144       320.00
   19808.255     0.997266       674473       365.71
   19841.023     0.997656       674747       426.67
   19873.791     0.998047       674914       512.00
   19906.559     0.998242       675063       568.89
   19939.327     0.998437       675242       640.00
   19955.711     0.998633       675312       731.43
   19988.479     0.998828       675452       853.33
   20021.247     0.999023       675561      1024.00
   20037.631     0.999121       675619      1137.78
   20070.399     0.999219       675720      1280.00
   20086.783     0.999316       675782      1462.86
   20103.167     0.999414       675833      1706.67
   20135.935     0.999512       675906      2048.00
   20152.319     0.999561       675936      2275.56
   20168.703     0.999609       675975      2560.00
   20185.087     0.999658       676007      2925.71
   20201.471     0.999707       676047      3413.33
   20217.855     0.999756       676074      4096.00
   20217.855     0.999780       676074      4551.11
   20234.239     0.999805       676096      5120.00
   20250.623     0.999829       676114      5851.43
   20250.623     0.999854       676114      6826.67
   20267.007     0.999878       676132      8192.00
   20283.391     0.999890       676144      9102.22
   20299.775     0.999902       676149     10240.00
   20348.927     0.999915       676158     11702.86
   20381.695     0.999927       676165     13653.33
   20463.615     0.999939       676174     16384.00
   20479.999     0.999945       676178     18204.44
   20496.383     0.999951       676180     20480.00
   20545.535     0.999957       676185     23405.71
   20561.919     0.999963       676189     27306.67
   20578.303     0.999969       676193     32768.00
   20594.687     0.999973       676196     36408.89
   20611.071     0.999976       676200     40960.00
   20611.071     0.999979       676200     46811.43
   20627.455     0.999982       676203     54613.33
   20627.455     0.999985       676203     65536.00
   20643.839     0.999986       676205     72817.78
   20643.839     0.999988       676205     81920.00
   20660.223     0.999989       676210     93622.86
   20660.223     0.999991       676210    109226.67
   20660.223     0.999992       676210    131072.00
   20660.223     0.999993       676210    145635.56
   20660.223     0.999994       676210    163840.00
   20660.223     0.999995       676210    187245.71
   20660.223     0.999995       676210    218453.33
   20676.607     0.999996       676213    262144.00
   20676.607     1.000000       676213          inf
#[Mean    =    11012.531, StdDeviation   =     4707.090]
#[Max     =    20660.224, Total count    =       676213]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  798969 requests in 1.00m, 330.40MB read
Requests/sec:  13316.43
Transfer/sec:      5.51MB